/***************************************************************************************************
 * @Description: <简要本验收用例测试的功能及测试点>
 * @ATCaseID: <填写 story 文档中验收用例的用例编号>
 * @Author: <用例编写人>
 * @TestlinkCase: 无（由测试人员维护，在测试阶段如果有测试场景引用本和例，则在此处填写 Testlink 用例编号，
 *                    并在 Testlink 系统中标记本用例文件名）
 * @Change Activity:
 * Date       Who         Description
 * ========== =========== =========================================================
 *
 **************************************************************************************************/

/*********************************************测试用例***********************************************
 * 环境准备：<简要描述本测试中必要的公共环境准备>
 * 测试场景：
 *    <描述测试场景>
 * 测试步骤：
 *    1.
 *    2.
 * 期望结果：
 *    <描述期望结果，如果有多个阶段的结果，应分别描述在哪个步骤中结果如何>
 *
 **************************************************************************************************/

main(test);

function test() {}

// 辅助函数
